kanji <- kbase$kanji
joyo2010ind <- 1:2136
joyo2010 <- kanji[joyo2010ind]
added <- c("媛","怨","鬱","唄","淫","咽","茨","彙","椅","萎","畏","嵐","宛","顎","曖","挨","韓","鎌","葛","骸","蓋","崖","諧","潰","瓦","牙","苛","俺","臆","岡","旺","艶","稽","憬","詣","熊","窟","串","惧",
           "錦","僅","巾","嗅","臼","畿","亀","伎","玩","挫","沙","痕","頃","駒","傲","乞","喉","梗","虎","股","舷","鍵","拳","桁","隙","呪","腫","嫉","𠮟","鹿","餌","摯","恣","斬","拶","刹","柵","埼","塞",
           "采","戚","脊","醒","凄","裾","須","腎","芯","尻","拭","憧","蹴","羞","袖","汰","遜","捉","踪","痩","曽","爽","遡","狙","膳","箋","詮","腺","煎","羨","鶴","爪","椎","捗","嘲","貼","酎","緻","綻",
           "旦","誰","戴","堆","唾","鍋","謎","梨","奈","那","丼","貪","頓","栃","瞳","藤","賭","妬","塡","溺","諦","阜","訃","肘","膝","眉","斑","阪","汎","氾","箸","剝","罵","捻","虹","匂","喩","闇","弥",
           "冶","麺","冥","蜜","枕","昧","勃","頰","貌","蜂","蔑","璧","餅","蔽","脇","麓","籠","弄","呂","瑠","瞭","侶","慄","璃","藍","辣","拉","沃","瘍","妖","湧","柿","哺","楷","睦","釜","錮","賂","毀","勾")
addedind <- match(added, joyo2010)
all(addedind == match(added, kanji))
removed <- c("勺","銑","脹","錘","匁")
removedind <- match(removed, kanji)
joyo1981ind <- c( setdiff(1:2136, addedind), removedind )
any(duplicated(joyo1981ind))
joyo1981ind <- sort(joyo1981ind)
joyo1981 <- kanji[joyo1981ind]

# just checking
yencken_ind <- which(rowSums(dstrokedit) > 0)
all(yencken_ind == joyo1981[joyo1981 <= 2136])
